{
  "title": "Modelo de Amenazas para Sistema de Campus Virtual",
  "description": "Modelo de amenazas detallado para identificar y gestionar posibles riesgos en un sistema de campus universitario.",
  "model": {
    "elements": [
      {
        "type": "asset",
        "id": "database",
        "name": "Base de Datos",
        "description": "Almacena información confidencial de estudiantes, personal y actividades del campus.",
        "tags": ["confidencialidad", "integridad", "disponibilidad"]
      },
      {
        "type": "asset",
        "id": "servidor",
        "name": "Servidor de Aplicaciones",
        "description": "Hospeda las aplicaciones críticas para el funcionamiento del campus.",
        "tags": ["disponibilidad"]
      },
      {
        "type": "threat",
        "id": "acceso_no_autorizado",
        "name": "Acceso No Autorizado",
        "description": "Intentos de acceso no autorizado a los sistemas del campus.",
        "tags": ["confidencialidad", "integridad", "disponibilidad"],
        "controls": [
          {
            "type": "preventivo",
            "description": "Implementar autenticación multifactorial para aumentar la seguridad de las cuentas de usuario."
          },
          {
            "type": "detectivo",
            "description": "Establecer registros de auditoría para monitorear e investigar actividades sospechosas."
          },
          {
            "type": "correctivo",
            "description": "Bloquear cuentas comprometidas y restablecer contraseñas según sea necesario."
          }
        ]
      },
      {
        "type": "threat",
        "id": "inyeccion_sql",
        "name": "Inyección SQL",
        "description": "Inserción de comandos SQL maliciosos en las consultas de entrada para manipular la base de datos.",
        "tags": ["confidencialidad", "integridad"],
        "controls": [
          {
            "type": "preventivo",
            "description": "Utilizar consultas parametrizadas y procedimientos almacenados para prevenir la inyección SQL."
          },
          {
            "type": "detectivo",
            "description": "Implementar sistemas de detección de intrusos para identificar patrones de ataque."
          },
          {
            "type": "correctivo",
            "description": "Aplicar parches de seguridad y restricciones de acceso adecuadas en la base de datos."
          }
        ]
      },
      {
        "type": "threat",
        "id": "denegacion_servicio",
        "name": "Ataque de Denegación de Servicio (DoS)",
        "description": "Intento de abrumar los recursos del sistema para que no estén disponibles para los usuarios legítimos.",
        "tags": ["disponibilidad"],
        "controls": [
          {
            "type": "preventivo",
            "description": "Implementar soluciones de mitigación de DoS, como firewalls y sistemas de prevención de intrusiones."
          },
          {
            "type": "detectivo",
            "description": "Monitorear el tráfico de red para detectar patrones de ataque y tráfico anormal."
          },
          {
            "type": "correctivo",
            "description": "Redireccionar el tráfico malicioso y restaurar los servicios afectados lo antes posible."
          }
        ]
      }
    ],
    "relationships": [
      {
        "type": "uses",
        "from": "acceso_no_autorizado",
        "to": "database",
        "description": "El acceso no autorizado compromete la confidencialidad e integridad de los datos almacenados."
      },
      {
        "type": "uses",
        "from": "inyeccion_sql",
        "to": "database",
        "description": "La inyección SQL puede permitir a un atacante acceder, modificar o eliminar datos sensibles en la base de datos."
      },
      {
        "type": "uses",
        "from": "denegacion_servicio",
        "to": "servidor",
        "description": "Un ataque de denegación de servicio puede sobrecargar el servidor, afectando su disponibilidad."
      }
    ]
  }
}
