{
  "version": "1.0",
  "title": "Modelo de Amenazas para Sistema de Campus Universitario",
  "description": "Modelo de amenazas para identificar y gestionar posibles riesgos en un sistema de campus universitario.",
  "model": {
    "elements": [
      {
        "type": "asset",
        "id": "database",
        "name": "Base de Datos",
        "description": "Almacena información confidencial de estudiantes, personal y actividades del campus."
      },
      {
        "type": "threat",
        "id": "unauthorized_access",
        "name": "Acceso No Autorizado",
        "description": "Intentos de acceso no autorizado a la base de datos.",
        "controls": [
          {
            "type": "preventative",
            "description": "Implementar autenticación sólida y control de acceso basado en roles."
          },
          {
            "type": "detective",
            "description": "Implementar registros de auditoría para rastrear intentos de acceso no autorizado."
          },
          {
            "type": "corrective",
            "description": "Bloquear y notificar intentos de acceso no autorizado."
          }
        ]
      },
      {
        "type": "threat",
        "id": "data_breach",
        "name": "Violación de Datos",
        "description": "Divulgación no autorizada de información sensible almacenada en la base de datos.",
        "controls": [
          {
            "type": "preventative",
            "description": "Encriptar datos sensibles en reposo y en tránsito."
          },
          {
            "type": "detective",
            "description": "Implementar sistemas de detección de intrusos para identificar actividad sospechosa."
          },
          {
            "type": "corrective",
            "description": "Notificar rápidamente a las partes afectadas y tomar medidas para mitigar el impacto."
          }
        ]
      },
      {
        "type": "threat",
        "id": "sql_injection",
        "name": "Inyección SQL",
        "description": "Ataques de inyección SQL dirigidos a la base de datos.",
        "controls": [
          {
            "type": "preventative",
            "description": "Utilizar consultas parametrizadas y filtrar la entrada de usuario."
          },
          {
            "type": "detective",
            "description": "Monitorear y registrar intentos de inyección SQL."
          },
          {
            "type": "corrective",
            "description": "Parchear las vulnerabilidades conocidas y aplicar actualizaciones de seguridad."
          }
        ]
      }
    ],
    "relationships": [
      {
        "type": "uses",
        "from": "unauthorized_access",
        "to": "database",
        "description": "El acceso no autorizado puede comprometer la base de datos."
      },
      {
        "type": "uses",
        "from": "data_breach",
        "to": "database",
        "description": "La violación de datos implica la exposición de información almacenada en la base de datos."
      },
      {
        "type": "uses",
        "from": "sql_injection",
        "to": "database",
        "description": "Los ataques de inyección SQL se dirigen a la base de datos para manipular datos o ejecutar comandos no autorizados."
      }
    ]
  }
}
